// 문제 설명
// n명이 입국심사를 위해 줄을 서서 기다리고 있습니다. 각 입국심사대에 있는 심사관마다 심사하는데 걸리는 시간은 다릅니다.
// 처음에 모든 심사대는 비어있습니다. 한 심사대에서는 동시에 한 명만 심사를 할 수 있습니다. 가장 앞에 서 있는 사람은 비어 있는 
// 심사대로 가서 심사를 받을 수 있습니다. 하지만 더 빨리 끝나는 심사대가 있으면 기다렸다가 그곳으로 가서 심사를 받을 수도 있습니다.
// 모든 사람이 심사를 받는데 걸리는 시간을 최소로 하고 싶습니다.
// 입국심사를 기다리는 사람 수 n, 각 심사관이 한 명을 심사하는데 걸리는 시간이 담긴 배열 times가 매개변수로 주어질 때, 
// 모든 사람이 심사를 받는데 걸리는 시간의 최솟값을 return 하도록 solution 함수를 작성해주세요.

// 제한사항
// 입국심사를 기다리는 사람은 1명 이상 1,000,000,000명 이하입니다.
// 각 심사관이 한 명을 심사하는데 걸리는 시간은 1분 이상 1,000,000,000분 이하입니다.
// 심사관은 1명 이상 100,000명 이하입니다.

function solution(n, times) {
    var answer = 0;
    times.sort();
    let start = 0;
    let end = times[times.length-1]*n;
    //0초~최대로 많이 걸린 시간에서 최소시간을 찾으면 됨.
    
    while(start<=end){
        const mid = Math.floor((start+end)/2);
        let count = 0; //시간안에 n명을 검사할 수 있는 지 판별.
        times.forEach((time) => {
            count+=Math.floor(mid/time);
        });
        if(count>=n){
            end=mid-1;
            answer=mid;
        }else{
            start=mid+1;
        }
    }
    
    return answer;
}